---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetMinSymbolWidth(Autodesk.Revit.DB.FamilySymbol)
source: html/d3bef761-7ce3-b2fb-219c-b37ef88c0030.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetMinSymbolWidth Method

Obtains the minimum width of the given FamilySymbol.

## Syntax (C#)
```csharp
public static double GetMinSymbolWidth(
	FamilySymbol symbol
)
```

## Parameters
- **symbol** (`Autodesk.Revit.DB.FamilySymbol`) - The family symbol.

## Returns
The minimum width.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null